object NoteService {


    //Добавление заметки
    fun add() {
        TODO()
    }

    //Добавляет новый комментарий к заметке
    fun createComment() {
        TODO()
    }

    //Удаляет заметку текущего пользователя
    fun delete() {
        TODO()
    }

    //Удаляет комментарий к заметке
    fun deleteComment(){
        TODO()
    }

    //Редактирует заметку текущего пользователя
    fun edit(){
        TODO()
    }

    //Редактирует указанный комментарий у заметки.
    fun editComment(){
        TODO()
    }

    //Возвращает список заметок, созданных пользователем.
    fun get(){
        TODO()
    }

    //Возвращает заметку по её id.
    fun getById(){
        TODO()
    }

    //Возвращает список комментариев к заметке.
    fun getComments(){
        TODO()
    }

    //Восстанавливает удалённый комментарий.
    fun restoreComment(){
        TODO()
    }

}